Stebym/stm32-course-jiroserob/practica3/Src/main.c
TIM_HandleTypeDef  htim2;   // encoder rotativo
TIM_HandleTypeDef  htim3;   // pwm de los 3 colores
TIM_HandleTypeDef  htim4;   // trigger del adc cada 20 ms
TIM_HandleTypeDef  htim10;  // blinky de 500 ms
ADC_HandleTypeDef  hadc1;   // potenciometro en PA4
UART_HandleTypeDef huart2;  // handle asincrono UART solicitado por el profe sin la S

// lecturas crudas de los sensores
uint32_t valor_adc = 0;
uint8_t  rx_data[1];            // buffer de un byte para la interrupcion

// duty cycles rango valido entre 0 apagado y 999 maximo brillo
volatile uint32_t pwm_rojo  = 0;
volatile uint32_t pwm_verde = 0;
volatile uint32_t pwm_azul  = 0;

// variables espejo para chequear cambios en tiempo real y transmitir de una
uint32_t pwm_rojo_ant  = 0;
uint32_t pwm_verde_ant = 0;
uint32_t pwm_azul_ant  = 0;
int32_t  clics_encoder_ant = 0;    // para detectar cambios en los clics de la perilla

// direccion del ultimo giro REAL del potenciometro (por encima del ruido), se
// mantiene aunque el pote este quieto, igual que el bit DIR del encoder en hardware
// 0 = aun no se ha movido, 1 = CW/derecha (sube), -1 = CCW/izquierda (baja)
volatile int8_t pot_direccion = 0;

// marca de tiempo del ultimo reporte enviado, para limitar la frecuencia de
// transmision (ver REPORTE_INTERVALO_MIN_MS)
uint32_t tick_ultimo_reporte = 0;

// flag que levanta la ISR cuando llega un byte por usart
volatile uint8_t serial_nuevo = 0;

// contador de clicks fisicos del encoder rotativo para la terminal
volatile int32_t clics_encoder = 0;

// estados de la maquina de estados finita (fsm)
typedef enum {
    ESTADO_LEER_ADC = 0,
    ESTADO_LEER_ENCODER,
    ESTADO_VERIFICAR_SERIAL,
    ESTADO_ESCRIBIR_PWM
} FSM_Estado_t;

FSM_Estado_t estado_fsm = ESTADO_LEER_ADC;


// -----------------------------------------------------------------------
// PROTOTIPOS
// -----------------------------------------------------------------------



void Inicializar_Hardware(void);
void GPIO_Init_Manual(void);
void TIM2_Encoder_Init(void);
void TIM3_PWM_Init(void);
void TIM4_Trigger_Init(void);
void TIM10_Blinky_Init(void);
void ADC1_Init_Manual(void);
void UART2_Init_Manual(void);
void MCO1_Config_Bono(void);
void Enviar_Menu_Bienvenida(void);

// -----------------------------------------------------------------------
// LOGICA PRINCIPAL
// -----------------------------------------------------------------------


/**
  * @brief  Punto de entrada del programa. Inicializa todo el hardware y
  *         arranca la maquina de estados (FSM) que corre para siempre.
  * @param  Ninguno
  * @retval int (nunca retorna en la practica, el while(1) es infinito)
  */
int main(void)
{
    // iniciamos el core tick a 1 ms latency flash nvic
    HAL_Init();

    // configuramos el hardware a mano sin ayudas graficas
    Inicializar_Hardware();

    // prender los modulos pwm antes del disparo automatico del adc
    HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);       // rojo PA6
    HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);       // verde PA7
    HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3);       // azul PB0

    // arranca el contador del encoder en las 2 fases (canal A y B)
    HAL_TIM_Encoder_Start(&htim2, TIM_CHANNEL_ALL);

    // tim4 pwm canal 4 genera flancos para el adc cada 20 ms
    HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_4);
    HAL_ADC_Start_IT(&hadc1); // armamos con interrupcion para disparar el callback

    // arrancar interrupciones del blinky y el receptor serial
    HAL_TIM_Base_Start_IT(&htim10);
    HAL_UART_Receive_IT(&huart2, rx_data, 1);

    // el banner sale una vez al arrancar, pero como la terminal casi nunca esta
    // conectada tan rapido, cualquier tecla no reconocida en el switch de abajo
    // lo vuelve a mandar (ver ESTADO_VERIFICAR_SERIAL) presionando ENTER alcanza
    Enviar_Menu_Bienvenida();
    uint32_t tick_menu_previo = HAL_GetTick(); // arranca el conteo de los 10 s justo aqui

    // la fsm corre para siempre aca adentro
    while (1)
    {
        switch (estado_fsm)
        {
            case ESTADO_LEER_ADC:
                // la conversion del pote la maneja HAL_ADC_ConvCpltCallback por interrupcion
                // la fsm solo avanza al siguiente estado
                estado_fsm = ESTADO_LEER_ENCODER;
                break;

            case ESTADO_LEER_ENCODER:
                {
                    // tim2 es de 32 bits cast a int32_t ayuda a detectar retroceso
                    int32_t cnt = (int32_t)htim2.Instance->CNT;

                    if (cnt < 0) {
                        cnt = 0;
                        htim2.Instance->CNT = 0;
                    } else if ((uint32_t)cnt > ENCODER_MAX) {
                        cnt = (int32_t)ENCODER_MAX;
                        htim2.Instance->CNT = ENCODER_MAX;
                    }

                    // mapeo del contador al pwm verde
                    pwm_verde = ((uint32_t)cnt * 999UL) / ENCODER_MAX;

                    // calculamos los clicks fisicos reales dividiendo por 4 los pasos
                    clics_encoder = cnt / 4;
                }
                estado_fsm = ESTADO_VERIFICAR_SERIAL;
                break;

            case ESTADO_VERIFICAR_SERIAL:
                // la isr levanta el flag cuando cae una letra en el receptor
                if (serial_nuevo)
                {
                    serial_nuevo = 0;
                    char letra = (char)rx_data[0];

                    if (letra == '+') {
                        pwm_rojo = (pwm_rojo + 10U <= 999U) ? pwm_rojo + 10U : 999U;
                    }
                    else if (letra == '-') {
                        pwm_rojo = (pwm_rojo >= 10U) ? pwm_rojo - 10U : 0U;
                    }
                    else if (letra == '0') {
                        pwm_rojo = 0U;
                    }
                    else if (letra == '1') {
                        // salta directo al 100%; el conteo de clics (ver mas abajo,
                        // se deriva siempre de pwm_rojo) va a mostrar el nivel 100
                        // de una, para poder bajar con '-' de forma consistente
                        pwm_rojo = 999U;
                    }
                    else if ((letra == 'm') || (letra == 'M')) {
                        // quinta tecla de cortesia: manda el rojo a la mitad exacta
                        pwm_rojo = 500U;
                    }
                    else {
                        // tecla no reconocida (ENTER, '?', etc): reimprime el
                        // menu de bienvenida, asi el usuario no depende de que
                        // el banner haya llegado justo antes de abrir la terminal
                        Enviar_Menu_Bienvenida();
                    }
                }
                estado_fsm = ESTADO_ESCRIBIR_PWM;
                break;

            case ESTADO_ESCRIBIR_PWM:
                // inyeccion de datos a las salidas fisicas del led rgb
                __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, pwm_rojo);
                __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, pwm_verde);
                __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, pwm_azul);

