Stebym/stm32-course-jiroserob/practica3/Src/main.c
                // diferencia con signo para saber hacia donde se movio el pote, y su
                // valor absoluto para el umbral de ruido de siempre
                int32_t diff_azul_signo = (int32_t)pwm_azul - (int32_t)pwm_azul_ant;
                int32_t diff_azul = (diff_azul_signo < 0) ? -diff_azul_signo : diff_azul_signo;

                // la direccion del pote solo se actualiza si el movimiento fue real
                // (mismo umbral de 4 cuentas que ya se usaba para filtrar ruido), y se
                // queda guardada aunque el pote no se mueva en los ciclos siguientes
                if (diff_azul > 4) {
                    pot_direccion = (diff_azul_signo > 0) ? 1 : -1;
                }

                // TRANSMISION AUTOMATICA REACTIVA
                // se dispara si cambia el pwm rojo, el encoder, o el azul (pote),
                // pero nunca mas seguido que REPORTE_INTERVALO_MIN_MS: sin este
                // limite, girar el pote despacio manda un bloque nuevo cada 20 ms
                // (un scroll ilegible en la terminal)
                uint8_t hay_cambio = (clics_encoder != clics_encoder_ant) ||
                                     (pwm_rojo != pwm_rojo_ant) || (diff_azul > 4);
                uint32_t ahora = HAL_GetTick();

                if (hay_cambio && ((ahora - tick_ultimo_reporte) >= REPORTE_INTERVALO_MIN_MS))
                {
                    // direccion real leida del registro del timer, no hay que inferirla comparando cuentas
                    const char *dir_encoder = __HAL_TIM_IS_TIM_COUNTING_DOWN(&htim2) ? "CCW" : "CW";

                    // direccion del pote inferida en software (ver arriba); "--" mientras no se haya
                    // movido todavia desde el arranque
                    const char *dir_pot = (pot_direccion > 0) ? "CW" :
                                          (pot_direccion < 0) ? "CCW" : "--";

                    // conversion de la lectura cruda del pote a milivoltios reales (escala 3.3 V)
                    uint32_t adc_mv = (valor_adc * 3300UL) / 4095UL;

                    // clics rojo SIEMPRE calculados desde el pwm real (redondeado a la
                    // unidad de 10 mas cercana), nunca se desincroniza: si el usuario dio
                    // '1' esto ya muestra "100 clics" (el equivalente a haber llegado a 999
                    // a punta de '+'), listo para bajar con '-' de forma consistente
                    uint32_t clics_rojo = (pwm_rojo + 5U) / 10U;

                    // un renglon por canal, con encabezado; hace scroll normal (sin
                    // ANSI), pero el limite de REPORTE_INTERVALO_MIN_MS de arriba ya
                    // evita que se dispare un bloque nuevo en cada muestra del ADC
                    char buffer_tx[260];
                    snprintf(buffer_tx, sizeof(buffer_tx),
                            "=== ESTADO EN VIVO ===\r\n"
                            "  Rojo  [UART]    : %3lu clics       -> PWM = %3lu (%3lu%%)\r\n"
                            "  Verde [Encoder] : %-3s  %2ld clics  -> PWM = %3lu (%3lu%%)\r\n"
                            "  Azul  [ADC]     : %-3s %4lu raw = %4lu mV -> PWM = %3lu (%3lu%%)\r\n\r\n",
                            clics_rojo, pwm_rojo, (pwm_rojo * 100UL) / 999UL,
                            dir_encoder, clics_encoder, pwm_verde, (pwm_verde * 100UL) / 999UL,
                            dir_pot, valor_adc, adc_mv, pwm_azul, (pwm_azul * 100UL) / 999UL);

                    // transmite de inmediato por polling asincrono
                    HAL_UART_Transmit(&huart2, (uint8_t*)buffer_tx, strlen(buffer_tx), 100);

                    // guardamos el estado actual en el espejo
                    pwm_rojo_ant       = pwm_rojo;
                    pwm_verde_ant      = pwm_verde;
                    pwm_azul_ant       = pwm_azul;
                    clics_encoder_ant  = clics_encoder;
                    tick_ultimo_reporte = ahora;
                }

                estado_fsm = ESTADO_LEER_ADC;
                break;

            default:
                estado_fsm = ESTADO_LEER_ADC;
                break;
        }

        // RECORDATORIO PERIODICO: reimprime el menu cada 30 s por si el usuario
        // se le olvidaron las teclas; HAL_GetTick() ya corre solo por el SysTick
        if ((HAL_GetTick() - tick_menu_previo) >= 30000U)
        {
            Enviar_Menu_Bienvenida();
            tick_menu_previo = HAL_GetTick();
        }
    }
}

// -----------------------------------------------------------------------
// CONFIGURACION MANUAL DE PINES (GPIO)
// -----------------------------------------------------------------------


/**
  * @brief  Configura a mano (sin CubeMX) todos los pines GPIO que usa la
  *         practica: salidas digitales (LEDs), entradas analogicas (pote),
  *         y pines en modo alternativo (AF) para el encoder, el PWM, el
  *         UART y la salida de reloj MCO1. Ver el mapa de pines completo
  *         en el encabezado del archivo.
  * @param  Ninguno
  * @retval Ninguno
  */
void GPIO_Init_Manual(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOH_CLK_ENABLE();

    // PH1 pin de salida digital para el led de la board auxiliar
    GPIO_InitStruct.Pin   = GPIO_PIN_1;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

    // PA5 led indicador de blinky del micro nucleo
    GPIO_InitStruct.Pin   = GPIO_PIN_5;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    // PA6 y PA7 salidas pwm del timer 3 canales 1 y 2 en modo af2
    GPIO_InitStruct.Pin       = GPIO_PIN_6 | GPIO_PIN_7;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    // PB0 canal 3 del timer 3 modo af2
    GPIO_InitStruct.Pin = GPIO_PIN_0;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

