Stebym/stm32-course-jiroserob/practica3/Src/main.c
    // PA0 y PA1 canales del encoder tim2 modo af1 con pullup critico
    GPIO_InitStruct.Pin       = GPIO_PIN_0 | GPIO_PIN_1;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_PULLUP;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Alternate = GPIO_AF1_TIM2;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    // PA4 pata del potenciometro en modo analogico
    GPIO_InitStruct.Pin  = GPIO_PIN_4;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    // PA2 pin de transmision af7 usart2
    GPIO_InitStruct.Pin       = GPIO_PIN_2;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    // PA3: USART2_RX desde el PC, pullup obligatorio segun la rubrica del pdf
    GPIO_InitStruct.Pin  = GPIO_PIN_3;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    // PA8 pin especial mco1 funcion af0 para sacar los 16 mhz al osciloscopo
    GPIO_InitStruct.Pin       = GPIO_PIN_8;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF0_MCO;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
}

// -----------------------------------------------------------------------
// INICIALIZACION DE TIMER ENCODER TIM2
// -----------------------------------------------------------------------


/**
  * @brief  Configura TIM2 en modo encoder (cuadratura TI12, los 4 flancos
  *         de ambos canales) para leer el encoder rotativo del canal
  *         verde. No usa interrupcion: la FSM lee el registro CNT
  *         directamente en cada vuelta del bucle principal.
  * @param  Ninguno
  * @retval Ninguno
  */
void TIM2_Encoder_Init(void)
{
    TIM_Encoder_InitTypeDef sConfig = {0};
    __HAL_RCC_TIM2_CLK_ENABLE();

    htim2.Instance           = TIM2;
    htim2.Init.Prescaler     = 0;
    htim2.Init.CounterMode   = TIM_COUNTERMODE_UP;
    htim2.Init.Period        = 0xFFFFFFFFU;
    htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;

    // cuadratura completa en ambos flancos TI12
    sConfig.EncoderMode  = TIM_ENCODERMODE_TI12;

    // filtros para que los ruidos mecanicos de la perilla no sumen de mas
    sConfig.IC1Polarity  = TIM_ICPOLARITY_RISING;
    sConfig.IC1Selection = TIM_ICSELECTION_DIRECTTI;
    sConfig.IC1Prescaler = TIM_ICPSC_DIV1;
    sConfig.IC1Filter    = 15;

    sConfig.IC2Polarity  = TIM_ICPOLARITY_RISING;
    sConfig.IC2Selection = TIM_ICSELECTION_DIRECTTI;
    sConfig.IC2Prescaler = TIM_ICPSC_DIV1;
    sConfig.IC2Filter    = 15;

    HAL_TIM_Encoder_Init(&htim2, &sConfig);
}

// -----------------------------------------------------------------------
// INICIALIZACION DE TIMER PWM RGB TIM3 (2 kHz)
// -----------------------------------------------------------------------



/**
  * @brief  Configura TIM3 con sus 3 canales de comparacion en modo PWM1
  *         (uno por cada color del LED RGB), a una frecuencia fija de
  *         2 kHz. El duty de cada canal se actualiza despues, en la FSM,
  *         con __HAL_TIM_SET_COMPARE.
  * @param  Ninguno
  * @retval Ninguno
  */
void TIM3_PWM_Init(void)
{
    TIM_OC_InitTypeDef sConfigOC = {0};
    __HAL_RCC_TIM3_CLK_ENABLE();

    htim3.Instance               = TIM3;
    htim3.Init.Prescaler         = 8 - 1;    // divide reloj a 2 mhz
    htim3.Init.CounterMode       = TIM_COUNTERMODE_UP;
    htim3.Init.Period            = 1000 - 1; // f = 2 mhz dividido 1000 igual a 2 khz exactos
    htim3.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    htim3.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    HAL_TIM_PWM_Init(&htim3);

    sConfigOC.OCMode     = TIM_OCMODE_PWM1;
    sConfigOC.Pulse      = 0;
    sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;

    HAL_TIM_PWM_ConfigChannel(&htim3, &sConfigOC, TIM_CHANNEL_1);
    HAL_TIM_PWM_ConfigChannel(&htim3, &sConfigOC, TIM_CHANNEL_2);
    HAL_TIM_PWM_ConfigChannel(&htim3, &sConfigOC, TIM_CHANNEL_3);
}

// -----------------------------------------------------------------------
// INICIALIZACION DE TIMER DISPARADOR TIM4 (20 ms)
// -----------------------------------------------------------------------



/**
  * @brief  Configura TIM4 exclusivamente como disparador automatico del
  *         ADC1 cada 20 ms (50 Hz), usando el canal de comparacion CC4 en
  *         modo PWM1 en vez de TRGO (el STM32F411 no tiene una salida
  *         TRGO valida para el ADC en este timer). No genera ninguna
  *         señal visible ni usa interrupcion propia.
  * @param  Ninguno
  * @retval Ninguno
  */
void TIM4_Trigger_Init(void)
{
    TIM_OC_InitTypeDef sConfigOC = {0};
    __HAL_RCC_TIM4_CLK_ENABLE();

    htim4.Instance               = TIM4;
    htim4.Init.Prescaler         = 16000 - 1; // tick de 1 ms
    htim4.Init.CounterMode       = TIM_COUNTERMODE_UP;
    htim4.Init.Period            = 20 - 1;    // periodo de 20 ms es decir 50 hz
    htim4.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    htim4.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    HAL_TIM_Base_Init(&htim4);

    // modo pwm1 genera un flanco de subida limpio cada 20 ms para despertar el modulo analogo
    sConfigOC.OCMode     = TIM_OCMODE_PWM1;
    sConfigOC.Pulse      = 9U;
    sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
    HAL_TIM_PWM_ConfigChannel(&htim4, &sConfigOC, TIM_CHANNEL_4);
}

// -----------------------------------------------------------------------
// INICIALIZACION DE TIMER BLINKY TIM10 (500 ms)
// -----------------------------------------------------------------------



/**
  * @brief  Configura TIM10 para generar una interrupcion cada 500 ms,
  *         usada unicamente para parpadear el LED indicador de la placa
  *         (PA5/PH1) desde HAL_TIM_PeriodElapsedCallback. Se le asigna
  *         prioridad alta en el NVIC para que nunca se atrase por culpa
  *         del UART o el ADC.
  * @param  Ninguno
  * @retval Ninguno
  */
void TIM10_Blinky_Init(void)
{
    __HAL_RCC_TIM10_CLK_ENABLE();

    htim10.Instance               = TIM10;
    htim10.Init.Prescaler         = 16000 - 1;
    htim10.Init.CounterMode       = TIM_COUNTERMODE_UP;
    htim10.Init.Period            = 500 - 1;   // desborda cada medio segundo
    htim10.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    htim10.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    HAL_TIM_Base_Init(&htim10);

    // prioridad alta para que no se trabe por culpa del serial
    HAL_NVIC_SetPriority(TIM1_UP_TIM10_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(TIM1_UP_TIM10_IRQn);
}

// -----------------------------------------------------------------------
// INICIALIZACION DEL MODULO ANALOGO ADC1
// -----------------------------------------------------------------------


/**
  * @brief  Configura el ADC1 en el canal 4 (PA4, potenciometro), 12 bits
  *         de resolucion, disparo externo por TIM4 (ver TIM4_Trigger_Init)
  *         y lectura por interrupcion (sin DMA). Solo se usa el grupo
  *         regular del ADC, nunca el grupo injected.
  * @param  Ninguno
  * @retval Ninguno
  */
void ADC1_Init_Manual(void)
{
    ADC_ChannelConfTypeDef sConfig = {0};
    __HAL_RCC_ADC1_CLK_ENABLE();

    hadc1.Instance                   = ADC1;
    hadc1.Init.ClockPrescaler        = ADC_CLOCK_SYNC_PCLK_DIV4;
    hadc1.Init.Resolution            = ADC_RESOLUTION_12B;
    hadc1.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
    hadc1.Init.ScanConvMode          = DISABLE;
    hadc1.Init.ContinuousConvMode    = DISABLE;  // conversion asincrona solo cuando el tim4 avise
    hadc1.Init.DiscontinuousConvMode = DISABLE;
    hadc1.Init.NbrOfConversion       = 1;
    hadc1.Init.ExternalTrigConv      = ADC_EXTERNALTRIGCONV_T4_CC4; // amarrado al canal 4 del tim4
    hadc1.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_RISING;
    hadc1.Init.DMAContinuousRequests = DISABLE;
    hadc1.Init.EOCSelection          = ADC_EOC_SINGLE_CONV;
    HAL_ADC_Init(&hadc1);

    // habilitamos la interrupcion del adc para que dispare el callback
    HAL_NVIC_SetPriority(ADC_IRQn, 3, 0);
    HAL_NVIC_EnableIRQ(ADC_IRQn);

    sConfig.Channel      = ADC_CHANNEL_4;
    sConfig.Rank         = 1;
    sConfig.SamplingTime = ADC_SAMPLETIME_15CYCLES;
    sConfig.Offset       = 0;
    HAL_ADC_ConfigChannel(&hadc1, &sConfig);
}

// -----------------------------------------------------------------------
// INICIALIZACION DEL PUERTO SERIAL ASINCRONO UART2
// -----------------------------------------------------------------------
/**
  * @brief  Configura USART2 como UART asincrono puro (sin señal de reloj
  *         compartida) a 115200 baudios, 8N1. La transmision se hace por
  *         polling; la recepcion se habilita por interrupcion en main()
  *         despues de esta inicializacion.
  * @param  Ninguno
  * @retval Ninguno
  */
void UART2_Init_Manual(void)
{
    __HAL_RCC_USART2_CLK_ENABLE();

    huart2.Instance          = USART2; // hardware fisico
    huart2.Init.BaudRate     = 115200;
    huart2.Init.WordLength   = UART_WORDLENGTH_8B;
    huart2.Init.StopBits     = UART_STOPBITS_1;
    huart2.Init.Parity       = UART_PARITY_NONE;
    huart2.Init.Mode         = UART_MODE_TX_RX;
    huart2.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
    huart2.Init.OverSampling = UART_OVERSAMPLING_16;
    HAL_UART_Init(&huart2); // configurado como uart asincrono puro sin reloj para que no se pegue

    HAL_NVIC_SetPriority(USART2_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(USART2_IRQn);
}

// -----------------------------------------------------------------------
// EXPORTACION DE RELOJ MCO1 (BONO EXTRA)
// -----------------------------------------------------------------------
/**
  * @brief  Bono: saca el reloj interno HSI (16 MHz, sin dividir) por el
  *         pin PA8 (MCO1), para poder verificarlo con un osciloscopio.
  * @param  Ninguno
  * @retval Ninguno
  */
void MCO1_Config_Bono(void)
{
    HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_HSI, RCC_MCODIV_1);
}

// -----------------------------------------------------------------------
// MENU DE BIENVENIDA POR USART2
// -----------------------------------------------------------------------
/**
  * @brief  Transmite por USART2 el menu de bienvenida con la lista de
  *         comandos disponibles. Se llama una vez al arrancar, cada 30 s
  *         como recordatorio, y cada vez que llega una tecla no
  *         reconocida (ver ESTADO_VERIFICAR_SERIAL en main).
  * @param  Ninguno
  * @retval Ninguno
  */
void Enviar_Menu_Bienvenida(void)
{
    static const char msg_bienvenida[] =
            "\r\n"
            "==========================================================\r\n"
            "         SISTEMA DE CONTROL INTERACTIVO TAREA 3           \r\n"
            "            Estudiante: Jimmy Stebym Rosero Barrera       \r\n"
            "==========================================================\r\n"
            " Control LED RGB (PWM 2kHz, 0-999 ticks)\r\n"
            " [COMANDOS DEL TECLADO]\r\n"
            "   ROJO  [serial]   : '+'=+1  '-'=-1  '0'=off  '1'=100%  'm'=50%\r\n"
            "   VERDE [encoder]  : CW(der)=+1  CCW(izq)=-1               \r\n"
            "   AZUL  [ADC]      : pote -> duty automatico, indica CW/CCW\r\n"
            "   (cualquier otra tecla reimprime este menu)              \r\n"
            " Este menu se reenvia solo cada 30 s como recordatorio\r\n"
            "==========================================================\r\n\r\n";

