Stebym/stm32-course-jiroserob/practica3/Src/main.c
    HAL_UART_Transmit(&huart2, (uint8_t*)msg_bienvenida, strlen(msg_bienvenida), HAL_MAX_DELAY);
}

// -----------------------------------------------------------------------
// LLAMADO DE HARDWARE CENTRAL
// -----------------------------------------------------------------------
/**
  * @brief  Llama en orden a todas las funciones de inicializacion manual
  *         de perifericos (GPIO, timers, ADC, UART y el bono de MCO1).
  *         Se ejecuta una sola vez, al arrancar main().
  * @param  Ninguno
  * @retval Ninguno
  */
void Inicializar_Hardware(void)
{
    GPIO_Init_Manual();
    MCO1_Config_Bono();
    TIM2_Encoder_Init();
    TIM3_PWM_Init();
    TIM4_Trigger_Init();
    TIM10_Blinky_Init();
    ADC1_Init_Manual();
    UART2_Init_Manual(); // inicializador del uart asincrono
}

// -----------------------------------------------------------------------
// CALLBACKS DE INTERRUPCIONES DE LA HAL
// -----------------------------------------------------------------------
/**
  * @brief  Callback de la HAL, invocado por TIM1_UP_TIM10_IRQHandler (en
  *         stm32f4xx_it.c) cada vez que TIM10 desborda (cada 500 ms).
  *         Alterna el LED indicador de la placa.
  * @param  htim Handle del timer que disparo la interrupcion
  * @retval Ninguno
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM10) {
        HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
        HAL_GPIO_TogglePin(GPIOH, GPIO_PIN_1); // prende led espejo de la board auxiliar
    }
}

/**
  * @brief  Callback de la HAL, invocado por USART2_IRQHandler (en
  *         stm32f4xx_it.c) cada vez que llega un byte nuevo por USART2.
  *         Levanta la bandera serial_nuevo (que la FSM revisa en
  *         ESTADO_VERIFICAR_SERIAL) y rearma la recepcion del siguiente byte.
  * @param  huart Handle del UART que disparo la interrupcion
  * @retval Ninguno
  */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART2) {
        serial_nuevo = 1;
        HAL_UART_Receive_IT(&huart2, rx_data, 1);
    }
}

/**
  * @brief  Callback de la HAL, invocado por ADC_IRQHandler (en
  *         stm32f4xx_it.c) cada vez que TIM4 dispara una conversion nueva
  *         del ADC1 (cada 20 ms). Lee el valor crudo, aplica la zona
  *         muerta y lo escala a duty de PWM (0-999), y rearma el ADC para
  *         la siguiente conversion.
  * @param  hadc Handle del ADC que disparo la interrupcion
  * @retval Ninguno
  */
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
    if (hadc->Instance == ADC1) {
        valor_adc = HAL_ADC_GetValue(&hadc1);

        // escala de 12 bits 4095 a rango pwm de 1000 pasos
        // zona muerta de 100 para eliminar ruido de piso
        if (valor_adc < 100U) {
            pwm_azul = 0U;
        } else {
            pwm_azul = (valor_adc * 999UL) / 4095UL;
        }

        // re-armamos para la siguiente disparo del tim4
        HAL_ADC_Start_IT(&hadc1);
    }
}
